// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

var numbers = new int[] {1, 2, 3, 4, 5, 6, 7, 8};
for (int i=0; i<numbers.Length; i++)
{
     Console.WriteLine(numbers[i]);
}
   